Repository: kaki-shu/Tsukuyomi
Catalog: Tsukuyomi/Resources/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# action.close
source: Close
ja: 閉じる
zh_hans: 关闭

# action.delete
source: Delete
ja: 削除
zh_hans: 删除

# action.edit
source: Edit
ja: 編集
zh_hans: 编辑

# action.save
source: Save
ja: 保存
zh_hans: 保存

# action.share
source: Share
ja: 共有
zh_hans: 分享

# ai.language.chineseSimplified
source: Chinese (Simplified)
ja: 中国語（簡体字）
zh_hans: 简体中文

# ai.language.english
source: English
ja: 英語
zh_hans: 英语

# ai.language.followApp
source: Follow App
ja: アプリの表示言語に合わせる
zh_hans: 跟随应用

# ai.language.japanese
source: Japanese
ja: 日本語
zh_hans: 日语

# ai.provider.apple.footer
source: Apple Intelligence uses the on-device system model. Availability depends on device eligibility and whether Apple Intelligence is enabled.
ja: Apple Intelligence はデバイス内蔵モデルを使用します。利用可否は端末要件と Apple Intelligence の有効状態に依存します。
zh_hans: Apple Intelligence 使用设备内置系统模型。是否可用取决于设备是否支持以及是否已启用 Apple Intelligence。

# ai.provider.body
source: Request Body
ja: リクエスト本文
zh_hans: 请求体

# ai.provider.capability.auditory
source: Audio
ja: 音声
zh_hans: 音频

# ai.provider.capability.auditory.description
source: Allow speech or audio input when the service supports it.
ja: サービスが対応している場合に音声入力を有効にします。
zh_hans: 当服务支持时允许语音或音频输入。

# ai.provider.capability.developer
source: Developer Role
ja: Developer ロール
zh_hans: Developer 角色

# ai.provider.capability.developer.description
source: Enable developer-role prompts for providers that support them.
ja: 対応する提供元で developer ロールのプロンプトを有効にします。
zh_hans: 为支持的提供方启用 developer 角色提示词。

# ai.provider.capability.tool
source: Tool Use
ja: ツール使用
zh_hans: 工具调用

# ai.provider.capability.tool.description
source: Allow the model to call structured tools during inference.
ja: 推論中に構造化ツール呼び出しを許可します。
zh_hans: 允许模型在推理过程中调用结构化工具。

# ai.provider.capability.visual
source: Vision
ja: 視覚
zh_hans: 视觉

# ai.provider.capability.visual.description
source: Enable image and screenshot understanding for compatible models.
ja: 対応モデルで画像やスクリーンショットの理解を有効にします。
zh_hans: 为兼容模型启用图片和截图理解能力。

# ai.provider.context
source: Context Limit
ja: コンテキスト上限
zh_hans: 上下文上限

# ai.provider.context.infinity
source: Infinity
ja: 無制限
zh_hans: 无限

# ai.provider.endpoint
source: Inference Endpoint
ja: 推論ノード
zh_hans: 推理节点

# ai.provider.key
source: API Key
ja: API キー

# ai.provider.model
source: Model Identifier
ja: モデル ID
zh_hans: 模型标识

# ai.provider.models.authRequired
source: The server requires request headers. Add Authorization or other required headers to Headers JSON.
ja: サーバーがリクエストヘッダーを要求しています。Authorization など必要なヘッダーを Headers JSON に追加してください。
zh_hans: 服务器需要请求头。请在 Headers JSON 中加入 Authorization 或其他必需头。

# ai.provider.models.count
source: %d models loaded.
ja: %d 件のモデルを読み込みました。
zh_hans: 已加载 %d 个模型。

# ai.provider.models.empty
source: No models were returned. Check the endpoint and Headers JSON.
ja: モデルが返されませんでした。エンドポイントとヘッダー JSON を確認してください。
zh_hans: 没有返回模型。请检查端点和 Headers JSON。

# ai.provider.models.fetch
source: Fetch Models from Server
ja: サーバーからモデル一覧を取得
zh_hans: 从服务器获取模型列表

# ai.provider.models.select
source: Select a Model
ja: モデルを選択
zh_hans: 选择模型

# ai.provider.models.ungrouped
source: Ungrouped
ja: 未分類
zh_hans: 未分组

# ai.provider.name
source: Nickname
ja: ニックネーム
zh_hans: 昵称

# ai.provider.new
source: New Provider
ja: 新しい提供元
zh_hans: 新建提供方

# ai.provider.preset
source: Preset
ja: プリセット
zh_hans: 预设

# ai.provider.response
source: Content Style
ja: コンテンツ形式
zh_hans: 内容样式

# ai.provider.response.chat
source: Chat Completions
ja: Chat Completions API

# ai.provider.response.responses
source: Responses
ja: Responses API

# ai.provider.section.basic
source: Basic
ja: 基本
zh_hans: 基础

# ai.provider.section.body
source: Body Fields JSON
ja: 追加リクエスト JSON

# ai.provider.section.capabilities
source: Capabilities
ja: 機能
zh_hans: 能力

# ai.provider.section.headers
source: Headers JSON
ja: ヘッダー JSON

# ai.provider.section.identity
source: Identity
ja: 基本情報
zh_hans: 标识

# ai.provider.section.metadata.footer
source: The endpoint should point to the provider root, and the model list endpoint should point to the server model listing API.
ja: 推論エンドポイントは提供元のベース URL を、モデル一覧エンドポイントはモデル取得 API を指定してください。
zh_hans: Endpoint 应指向提供方根地址，模型列表地址应指向服务端的模型列表 API。

# ai.provider.section.model
source: Model
ja: モデル
zh_hans: 模型

# ai.provider.section.networking
source: Networking (Advanced)
ja: ネットワーク（詳細）
zh_hans: 网络（高级）

# ai.provider.section.networking.footer
source: Extra headers and body fields can be used for provider-specific options such as reasoning flags or tenant routing.
ja: 追加ヘッダーや追加リクエスト JSON は、推論オプションやテナントルーティングなど提供元固有の設定に利用できます。
zh_hans: 额外请求头和 Body Fields 可用于推理开关、租户路由等提供方专用参数。

# ai.provider.section.parameters
source: Parameters
ja: パラメータ
zh_hans: 参数

# ai.provider.section.prompts
source: Prompts
ja: プロンプト
zh_hans: 提示词

# ai.provider.section.request
source: Request
ja: リクエスト
zh_hans: 请求

# ai.providers.add
source: Add Provider
ja: 提供元を追加
zh_hans: 添加提供方

# ai.providers.default.badge
source: Default
ja: デフォルト
zh_hans: 默认

# ai.providers.default.label
source: Current
ja: 現在
zh_hans: 当前

# ai.providers.default.section
source: Default Provider
ja: デフォルトの提供元
zh_hans: 默认提供方

# ai.providers.duplicate
source: Duplicate
ja: 複製
zh_hans: 复制

# ai.providers.empty
source: No providers configured yet. Add one when you are ready to use AI actions.
ja: 提供元はまだ設定されていません。AI アクションを使う準備ができたら追加してください。
zh_hans: 还没有配置提供方。准备使用 AI 动作时请先添加一个。

# ai.providers.makeDefault
source: Set as Default
ja: デフォルトに設定
zh_hans: 设为默认

# ai.providers.section
source: Providers
ja: 提供元
zh_hans: 提供方

# ai.settings.inference.footer
source: These options control the default provider, AI output language, translation layout, and whether article actions run automatically.
ja: ここでは既定の提供元、AI の出力言語、翻訳表示、記事アクションの自動実行を設定できます。
zh_hans: 这里控制默认提供方、AI 输出语言、翻译显示方式，以及文章 AI 动作是否自动执行。

# ai.settings.inference.section
source: Inference
ja: 推論
zh_hans: 推理

# ai.settings.language
source: Language
ja: 言語
zh_hans: 语言

# ai.settings.language.section
source: Output
ja: 出力
zh_hans: 输出

# ai.settings.titles.bilingual
source: Original + Translation
ja: 原文 + 翻訳
zh_hans: 原文 + 译文

# ai.settings.titles.mode
source: Title Translation
ja: タイトル翻訳
zh_hans: 标题翻译

# ai.settings.titles.original
source: Original Only
ja: 原文タイトルのみ
zh_hans: 仅原文标题

# ai.settings.titles.translationOnly
source: Translated Only
ja: 翻訳タイトルのみ
zh_hans: 仅译文标题

# ai.settings.translation.bilingual
source: Original + Translation
ja: 原文 + 翻訳
zh_hans: 原文 + 译文

# ai.settings.translation.mode
source: Translation Display
ja: 翻訳表示
zh_hans: 翻译显示

# ai.settings.translation.only
source: Translation Only
ja: 翻訳のみ
zh_hans: 仅译文

# ai.settings.translation.replace
source: Replace Original
ja: 原文を置き換える
zh_hans: 替换原文

# article.ai.actions
source: AI Actions
ja: AI アクション
zh_hans: AI 操作

# article.ai.error.title
source: AI Request Failed
ja: AI リクエストに失敗しました
zh_hans: AI 请求失败

# article.ai.summarize
source: Summarize
ja: 要約
zh_hans: 摘要

# article.ai.summary
source: AI Summary
ja: AI 要約
zh_hans: AI 摘要

# article.ai.translate
source: Translate
ja: 翻訳
zh_hans: 翻译

# article.ai.translation
source: AI Translation
ja: AI 翻訳
zh_hans: AI 翻译

# article.body.title
source: Article
ja: 本文
zh_hans: 正文

# article.browser.open
source: Browser
ja: ブラウザ
zh_hans: 浏览器

# article.original.title
source: Original
ja: 原文
zh_hans: 原文

# article.source.title
source: Source
ja: ソース
zh_hans: 来源

# article.translation.title
source: Translation
ja: 翻訳
zh_hans: 译文

# clips.export.error.title
source: Export Failed
ja: エクスポートに失敗しました
zh_hans: 导出失败

# clips.export.progress
source: Exporting Clips
ja: クリップをエクスポート中
zh_hans: 正在导出剪藏

# font.system
source: System
ja: システム
zh_hans: 系统

# pages.add.section.url
source: Web Page URL
ja: Web ページ URL
zh_hans: 网页 URL

# pages.add.title
source: Add Clip
ja: クリップを追加
zh_hans: 添加剪藏

# pages.clip.add
source: Add to Clip
ja: クリップに追加
zh_hans: 加入剪藏

# pages.clip.remove
source: Remove from Clip
ja: クリップから削除
zh_hans: 移出剪藏

# pages.clip.remove.title
source: Remove from Clip
ja: クリップから削除
zh_hans: 移出剪藏

# pages.empty.message
source: Use the plus button to save a web page, or bookmark an article from its reader.
ja: 右上のプラスで Web ページを保存するか、記事画面のブックマークで追加できます。
zh_hans: 用右上角加号保存网页，或在文章页点书签加入剪藏。

# pages.empty.title
source: No clips yet
ja: まだクリップがありません
zh_hans: 还没有剪藏

# pages.hero.body
source: Add a URL from the web or save an article from your feeds. Everything stays local first, ready for AI when you need it.
ja: Web の URL を保存しても、RSS からスターしてもここに集まります。まずはローカルに残し、必要な時だけ AI を使えます。
zh_hans: 无论是手动保存网页，还是从 RSS 加星，都会集中在这里。内容先本地保存，需要时再交给 AI 处理。

# pages.hero.title
source: Keep the pages worth revisiting.
ja: あとで読み返したいページをまとめておく。
zh_hans: 把值得回看的页面留下来。

# pages.saved.feed
source: Saved From RSS
ja: RSS から保存
zh_hans: 从 RSS 保存

# pages.saved.web
source: Clips
ja: クリップ
zh_hans: 剪藏

# pages.title
source: Clips
ja: クリップ
zh_hans: 剪藏

# rss.add.error.duplicate
source: This RSS source has already been added.
ja: この RSS ソースは既に追加されています。
zh_hans: 这个 RSS 源已经添加过了。

# rss.add.http.note
source: Both http and https RSS sources are supported.
ja: http と https の RSS ソースに対応しています。
zh_hans: 支持导入 http 和 https 的 RSS 源。

# rss.add.section.recommended
source: Recommended
ja: おすすめ
zh_hans: 推荐

# rss.add.section.url
source: Feed URL
ja: フィード URL

# rss.add.title
source: Add Feed
ja: フィードを追加
zh_hans: 添加 Feed

# rss.edit.feedURL
source: Feed URL
ja: フィード URL

# rss.edit.section.identity
source: Feed
ja: フィード
zh_hans: 源

# rss.edit.siteURL
source: Site URL
ja: サイト URL
zh_hans: 站点 URL

# rss.edit.subtitle
source: Subtitle
ja: サブタイトル
zh_hans: 副标题

# rss.edit.title
source: Title
ja: タイトル
zh_hans: 标题

# rss.hero.body
source: Inspired by SakuraRSS, Tsukuyomi keeps the first release focused on the flow from discovery to saving and AI refinement.
ja: SakuraRSS に着想を得て、最初の版では発見、保存、AI 加工までの流れに集中しています。
zh_hans: 借鉴 SakuraRSS 的体验，首版先专注于发现、保存和 AI 加工这条链路。

# rss.hero.title
source: Moonlit reading for feeds that deserve a second pass.
ja: もう一度読み返したい feed のための、静かな読書空間。
zh_hans: 为值得再读一遍的 feed 留出一片月光下的阅读区。

# rss.latest.title
source: Latest
ja: 最新
zh_hans: 最新

# rss.metric.feeds
source: Feeds
ja: フィード数

# rss.metric.saved
source: Saved
ja: 保存
zh_hans: 保存

# rss.saved.empty.message
source: Star an article to send it to Pages.
ja: 記事にスターを付けると Pages に送られます。
zh_hans: 给文章加星后，它就会出现在 Pages 中。

# rss.saved.empty.title
source: Nothing saved yet
ja: まだ保存はありません
zh_hans: 还没有保存内容

# rss.saved.title
source: Saved For Later
ja: あとで読む
zh_hans: 稍后读

# rss.source.articles
source: Articles
ja: 記事
zh_hans: 文章

# rss.source.items
source: items
ja: 件
zh_hans: 条

# rss.source.lastRefresh
source: Last refresh
ja: 最終更新
zh_hans: 上次刷新

# rss.source.title
source: Feed
ja: フィード

# rss.sources.delete.message
source: Delete %@ and remove its cached articles?
ja: %@ と関連するキャッシュ記事を削除しますか？
zh_hans: 删除 %@ 并移除它缓存的文章吗？

# rss.sources.delete.title
source: Delete Source
ja: ソースを削除
zh_hans: 删除源

# rss.sources.empty.message
source: Use the plus button to add an RSS source. Recommended feeds are available in the add sheet.
ja: 右上のプラスで RSS ソースを追加できます。追加画面におすすめも用意しています。
zh_hans: 使用右上角加号添加 RSS 源，添加页里也准备了推荐源。

# rss.sources.empty.title
source: No feeds yet
ja: まだフィードがありません
zh_hans: 还没有 RSS 源

# rss.sources.sort.count
source: Article Count
ja: 記事数
zh_hans: 文章数量

# rss.sources.sort.manual
source: Added Order
ja: 追加順
zh_hans: 添加顺序

# rss.sources.sort.name
source: Name
ja: 名称
zh_hans: 名称

# rss.sources.sort.refresh
source: Latest Refresh
ja: 最新更新
zh_hans: 最近刷新

# rss.sources.sort.title
source: Sort
ja: 並び替え
zh_hans: 排序

# rss.sources.title
source: Sources
ja: RSSソース
zh_hans: 源

# settings.ai.autoSummary
source: Automatic Summary
ja: 自動要約
zh_hans: 自动摘要

# settings.ai.autoTranslation
source: Automatic Translation
ja: 自動翻訳
zh_hans: 自动翻译

# settings.ai.none
source: Not Set
ja: 未設定
zh_hans: 未设置

# settings.ai.providers
source: AI Settings
ja: AI 設定
zh_hans: AI 设置

# settings.build.build
source: Build
ja: ビルド
zh_hans: 构建号

# settings.build.name
source: Name
ja: 名称
zh_hans: 名称

# settings.build.version
source: Version
ja: バージョン
zh_hans: 版本

# settings.capture.body
source: Tsukuyomi records app lifecycle, RSS refresh, storage events, AI requests, and basic network state. The log catcher refreshes whenever the app becomes active.
ja: Tsukuyomi はアプリのライフサイクル、RSS 更新、保存処理、AI リクエスト、基本的なネットワーク状態を記録します。アプリがアクティブになるたびにログキャプチャを更新します。
zh_hans: Tsukuyomi 会记录应用生命周期、RSS 刷新、持久化、AI 请求和基础网络状态。每次应用进入活跃态时都会刷新日志捕捉器。

# settings.font.body
source: Body Font
ja: 本文フォント
zh_hans: 正文字体

# settings.font.title
source: Title Font
ja: タイトルフォント
zh_hans: 标题字体

# settings.logs.clear
source: Clear Stored Logs
ja: 保存済みログを消去
zh_hans: 清除已存日志

# settings.logs.export
source: Export Current Log
ja: 現在のログをエクスポート
zh_hans: 导出当前日志

# settings.logs.refresh
source: Refresh Log Catcher
ja: ログキャプチャを更新
zh_hans: 刷新日志捕捉器

# settings.opensource.note.body
source: Only repositories that are currently referenced in Tsukuyomi's code or implementation flow are listed here.
ja: ここには、現在の Tsukuyomi のコードまたは実装フローで実際に参照しているリポジトリだけを掲載しています。
zh_hans: 这里只列出当前在 Tsukuyomi 代码或实现流程中实际引用到的仓库。

# settings.opensource.sakura.usage
source: Tsukuyomi borrows article extraction cleanup ideas, YouTube feed discovery patterns, and dedicated YouTube player flow refinements from SakuraRSS where they directly improved this app.
ja: Tsukuyomi では、SakuraRSS から記事抽出の後処理、YouTube フィード発見パターン、専用 YouTube プレーヤーフローの改善点を取り入れています。
zh_hans: Tsukuyomi 借鉴了 SakuraRSS 中对本文抽取后处理、YouTube 源发现模式以及专用 YouTube 播放页面流程的优化思路。

# settings.opensource.section.note
source: Note
ja: 注記
zh_hans: 说明

# settings.opensource.section.used
source: Used in Tsukuyomi
ja: Tsukuyomi で使用
zh_hans: Tsukuyomi 中使用

# settings.opensource.streaming.usage
source: Tsukuyomi uses SwiftStreamingMarkdown for Markdown text rendering and smoother streamed translation updates, while keeping its own image rendering pipeline.
ja: Tsukuyomi では、Markdown のテキスト描画とストリーミング翻訳表示の改善に SwiftStreamingMarkdown を使い、画像描画は独自パイプラインを維持しています。
zh_hans: Tsukuyomi 使用 SwiftStreamingMarkdown 优化 Markdown 文本渲染和流式翻译显示，同时保留自己的图片渲染管线。

# settings.opensource.swiftsoup.usage
source: Tsukuyomi uses SwiftSoup for HTML parsing and article content cleanup.
ja: Tsukuyomi では、HTML 解析と記事本文のクリーンアップに SwiftSoup を使用しています。
zh_hans: Tsukuyomi 使用 SwiftSoup 进行 HTML 解析和文章正文清理。

# settings.openSource.title
source: Open Source
ja: オープンソース
zh_hans: 开源引用

# settings.section.build
source: Build
ja: ビルド
zh_hans: 构建信息

# settings.section.capture
source: Capture Scope
ja: 記録範囲
zh_hans: 捕捉范围

# settings.section.integrations
source: Integrations
ja: 連携
zh_hans: 集成

# settings.section.logs
source: Logs
ja: ログ
zh_hans: 日志

# settings.section.reading
source: Reading
ja: 表示と読書
zh_hans: 阅读

# settings.section.storage
source: Local Data
ja: ローカルデータ
zh_hans: 本地数据

# settings.storage.articles
source: Articles
ja: 記事
zh_hans: 文章

# settings.storage.pages
source: Clips
ja: クリップ
zh_hans: 剪藏

# settings.storage.sources
source: Sources
ja: RSSソース
zh_hans: 源

# settings.title
source: Settings
ja: 設定
zh_hans: 设置

# settings.youtube.value
source: Player & Login
ja: プレイヤーとログイン
zh_hans: 播放器与登录

# sources.opml.empty
source: No RSS feeds were found in this OPML file.
ja: この OPML ファイルには RSS ソースが見つかりませんでした。
zh_hans: 这个 OPML 文件里没有找到 RSS 源。

# sources.opml.error.title
source: OPML Error
ja: OPML エラー
zh_hans: OPML 错误

# sources.opml.export
source: Export OPML
ja: OPML をエクスポート
zh_hans: 导出 OPML

# sources.opml.import
source: Import OPML
ja: OPML をインポート
zh_hans: 导入 OPML

# sources.opml.import.partial
source: %d feeds imported. Failed: %@
ja: %d 件の RSS ソースをインポートしました。失敗: %@
zh_hans: 已导入 %d 个 RSS 源。失败：%@

# sources.opml.import.result.title
source: OPML Import
ja: OPML インポート
zh_hans: OPML 导入

# sources.opml.import.success
source: %d feeds imported.
ja: %d 件の RSS ソースをインポートしました。
zh_hans: 已导入 %d 个 RSS 源。

# tab.pages
source: Clips
ja: クリップ
zh_hans: 剪藏

# tab.settings
source: Settings
ja: 設定
zh_hans: 设置

# tab.sources
source: Sources
ja: ソース
zh_hans: 源

# youtube.login.title
source: YouTube Login
ja: YouTube ログイン
zh_hans: YouTube 登录

# youtube.settings.account.signedIn
source: Signed In
ja: ログイン済み
zh_hans: 已登录

# youtube.settings.account.signedOut
source: Not Signed In
ja: 未ログイン
zh_hans: 未登录

# youtube.settings.account.status
source: Status
ja: 状態
zh_hans: 状态

# youtube.settings.player
source: Playback
ja: 再生
zh_hans: 播放

# youtube.settings.player.footer
source: YouTube videos open in a dedicated player page with inline playback, browser access, and session-aware cookies.
ja: YouTube 動画は専用プレイヤーページで開き、インライン再生、ブラウザ表示、セッション Cookie に対応します。
zh_hans: YouTube 视频会在专用播放页面打开，支持内嵌播放、浏览器访问和会话 Cookie。

# youtube.settings.player.value
source: Dedicated YouTube Page
ja: 専用 YouTube ページ
zh_hans: 专用 YouTube 页面

# youtube.settings.section.account
source: Account
ja: アカウント
zh_hans: 账号

# youtube.settings.section.player
source: Player
ja: プレイヤー
zh_hans: 播放器

# youtube.settings.signin
source: Sign In
ja: ログイン
zh_hans: 登录

# youtube.settings.signout
source: Sign Out
ja: ログアウト
zh_hans: 退出登录

# action.ok
source: OK
zh_hans: 确定

# ai.provider.apple.name
source: Apple Intelligence
zh_hans: Apple 智能

# settings.build.bundle
source: Bundle
zh_hans: 包名
